/*******************************************************
* Copyright (c) 2009-2011 HED
* All rights reserved.
*
* 文件名称：GPIO.c
* 文件标识：
* 摘    要：GPIO接口的配置及读写
*
* 当前版本：1.0
* 作    者：wang xindong
* 完成日期：2009年2月12日
**********************************************************/

#include <CIU96S192UFB.h>

/****************************************************************************
*   功能：GPIO应用示例
*   输入：无
*   输出：无
*   说明：本函数仅提供GPIO的应用思路
*****************************************************************************/
void GPIO(void)
{
    unsigned int GpioStatus;

    GPIOEN = 1;             //使能GPIO口
    GPIODDR = 0x00ff;       //设置Gpio0~Gpio15为输出，Gpio16~Gpio19为输入

    GPIODRL = 0x0001;       //Gpio0设置高电平

    GpioStatus = GPIODR;    //读取GPIO口状态

    GPIOEN = 1;             //关闭GPIO口
}
